
**Terraform Cloud Plan Output**



<details><summary>Show Plan(infra/aws/prod)</summary>

```

[command]/home/runner/work/_temp/209a151b-9a7c-45ad-a752-49f9eb131a7f/terraform-bin plan -no-color
2024-05-27T15:24:50.148Z [INFO]  Terraform version: 1.8.1
2024-05-27T15:24:50.148Z [INFO]  Go runtime version: go1.22.1
2024-05-27T15:24:50.148Z [INFO]  CLI args: []string{"/home/runner/work/_temp/209a151b-9a7c-45ad-a752-49f9eb131a7f/terraform-bin", "plan", "-no-color"}
2024-05-27T15:24:50.148Z [INFO]  CLI command args: []string{"plan", "-no-color"}
2024-05-27T15:24:50.152Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=d3eee869-444f-9bf3-e5d7-0638b25aa13c tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials
2024-05-27T15:24:51.021Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=d3eee869-444f-9bf3-e5d7-0638b25aa13c tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-27T15:24:51.208Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=d3eee869-444f-9bf3-e5d7-0638b25aa13c tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-27T15:24:51.575Z [INFO]  backend/local: starting Plan operation
2024-05-27T15:24:52.340Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=6df1da2b-8031-6b93-f319-05e2190d59f9 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate
2024-05-27T15:24:52.894Z [INFO]  provider: configuring client automatic mTLS
2024-05-27T15:24:52.993Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-27T15:24:52.992Z
2024-05-27T15:24:53.650Z [INFO]  provider: configuring client automatic mTLS
2024-05-27T15:24:53.659Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-27T15:24:53.658Z
2024-05-27T15:24:53.687Z [INFO]  provider: configuring client automatic mTLS
2024-05-27T15:24:53.767Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-27T15:24:53.766Z
2024-05-27T15:24:53.792Z [INFO]  provider: configuring client automatic mTLS
2024-05-27T15:24:53.806Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-27T15:24:53.806Z
2024-05-27T15:24:53.903Z [INFO]  backend/local: plan calling Plan
2024-05-27T15:24:53.907Z [INFO]  provider: configuring client automatic mTLS
2024-05-27T15:24:53.991Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-27T15:24:53.991Z
2024-05-27T15:24:54.016Z [INFO]  provider: configuring client automatic mTLS
2024-05-27T15:24:54.028Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-27T15:24:54.025Z
random_string.password: Refreshing state... [id=M9axbhdBAI9j4gg4]
2024-05-27T15:24:54.117Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved credentials: tf_aws.credentials_source=EnvConfigCredentials tf_req_id=a3576bcd-8702-910b-c1c9-01e6359749c1 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws @module=aws.aws-base timestamp=2024-05-27T15:24:54.117Z
2024-05-27T15:24:54.854Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved caller identity from STS: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=a3576bcd-8702-910b-c1c9-01e6359749c1 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_rpc=ConfigureProvider timestamp=2024-05-27T15:24:54.853Z
aws_db_subnet_group.algosovled-subnet-group: Refreshing state... [id=algosolved-subnet-group]
aws_ecr_repository.algosolved_repository: Refreshing state... [id=algosolved-ecr]
aws_lb_target_group.algosolved-lb-tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:targetgroup/algosolved-ec2-target-group/834fe560b1474f0f]
aws_security_group.algosolved-rds-sg: Refreshing state... [id=sg-04bcecd9b86d61bad]
data.aws_ami.ubuntu: Reading...
aws_security_group.algosolved-ec2-sg: Refreshing state... [id=sg-012edd67d8f2929e0]
2024-05-27T15:24:55.692Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
aws_lb.algosolved-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:loadbalancer/app/algosolved-alb/b2ca87625a4599c9]
2024-05-27T15:24:55.719Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-rds-sg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute
2024-05-27T15:24:55.871Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .tags_all: planned value cty.MapValEmpty(cty.String) does not match config value cty.MapVal(map[string]cty.Value{"Project":cty.StringVal("algosolved"), "Stage":cty.StringVal("prod")}) nor prior value cty.MapVal(map[string]cty.Value{"Project":cty.StringVal("algosolved"), "Stage":cty.StringVal("prod")})
      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute
      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute
      - .encryption_configuration: block count in plan (1) disagrees with count in config (0)
      - .image_scanning_configuration: block count in plan (1) disagrees with count in config (0)
data.aws_ami.ubuntu: Read complete after 1s [id=ami-00dade17b7cbec931]
aws_launch_template.algosolved-lt: Refreshing state... [id=lt-0ab2561671d221a8a]
2024-05-27T15:24:56.311Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb_target_group.algosolved-lb-tg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .lambda_multi_value_headers_enabled: planned value cty.False for a non-computed attribute
      - .proxy_protocol_v2: planned value cty.False for a non-computed attribute
      - .slow_start: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .target_type: planned value cty.StringVal("instance") for a non-computed attribute
      - .target_failover: block count in plan (1) disagrees with count in config (0)
      - .target_health_state: block count in plan (1) disagrees with count in config (0)
      - .health_check[0].protocol: planned value cty.StringVal("HTTP") for a non-computed attribute
      - .health_check[0].enabled: planned value cty.True for a non-computed attribute
      - .stickiness: block count in plan (1) disagrees with count in config (0)
2024-05-27T15:24:56.433Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .user_data: planned value cty.StringVal("") for a non-computed attribute
      - .ebs_optimized: planned value cty.StringVal("") for a non-computed attribute
      - .ram_disk_id: planned value cty.StringVal("") for a non-computed attribute
      - .security_group_names: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .disable_api_stop: planned value cty.False for a non-computed attribute
      - .disable_api_termination: planned value cty.False for a non-computed attribute
      - .instance_initiated_shutdown_behavior: planned value cty.StringVal("") for a non-computed attribute
      - .kernel_id: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].no_device: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].virtual_name: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].encrypted: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].kms_key_id: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].snapshot_id: planned value cty.StringVal("") for a non-computed attribute
      - .block_device_mappings[0].ebs[0].delete_on_termination: planned value cty.StringVal("") for a non-computed attribute
aws_autoscaling_group.algosolved-ec2-asg: Refreshing state... [id=algosolved-ec2-asg]
2024-05-27T15:24:56.576Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_subnet_group.algosovled-subnet-group, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .description: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute
2024-05-27T15:24:56.583Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_instance.algosolved-rdb, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .publicly_accessible: planned value cty.False for a non-computed attribute
      - .monitoring_interval: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .delete_automated_backups: planned value cty.True for a non-computed attribute
      - .auto_minor_version_upgrade: planned value cty.True for a non-computed attribute
      - .apply_immediately: planned value cty.False for a non-computed attribute
      - .performance_insights_enabled: planned value cty.False for a non-computed attribute
      - .dedicated_log_volume: planned value cty.False for a non-computed attribute
      - .copy_tags_to_snapshot: planned value cty.False for a non-computed attribute
      - .skip_final_snapshot: planned value cty.False for a non-computed attribute
2024-05-27T15:24:56.686Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb.algosolved-lb, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .drop_invalid_header_fields: planned value cty.False for a non-computed attribute
      - .enable_xff_client_port: planned value cty.False for a non-computed attribute
      - .enable_tls_version_and_cipher_suite_headers: planned value cty.False for a non-computed attribute
      - .xff_header_processing_mode: planned value cty.StringVal("append") for a non-computed attribute
      - .desync_mitigation_mode: planned value cty.StringVal("defensive") for a non-computed attribute
      - .preserve_host_header: planned value cty.False for a non-computed attribute
      - .enable_http2: planned value cty.True for a non-computed attribute
      - .enable_waf_fail_open: planned value cty.False for a non-computed attribute
      - .customer_owned_ipv4_pool: planned value cty.StringVal("") for a non-computed attribute
      - .enable_cross_zone_load_balancing: planned value cty.True for a non-computed attribute
      - .client_keep_alive: planned value cty.NumberIntVal(3600) for a non-computed attribute
      - .enable_deletion_protection: planned value cty.False for a non-computed attribute
      - .access_logs: block count in plan (1) disagrees with count in config (0)
      - .connection_logs: block count in plan (1) disagrees with count in config (0)
aws_alb_listener.algosolved-http-forward: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:listener/app/algosolved-alb/b2ca87625a4599c9/f8e55bf4f14dd805]
2024-05-27T15:24:57.347Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .termination_policies: planned value cty.ListValEmpty(cty.String) for a non-computed attribute
      - .context: planned value cty.StringVal("") for a non-computed attribute
      - .enabled_metrics: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .launch_configuration: planned value cty.StringVal("") for a non-computed attribute
      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute
      - .suspended_processes: planned value cty.SetValEmpty(cty.String) for a non-computed attribute
      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute
      - .protect_from_scale_in: planned value cty.False for a non-computed attribute
      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute
      - .force_delete: planned value cty.False for a non-computed attribute
      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute
      - .placement_group: planned value cty.StringVal("") for a non-computed attribute
      - .default_instance_warmup: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .desired_capacity_type: planned value cty.StringVal("") for a non-computed attribute
      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute
      - .max_instance_lifetime: planned value cty.NumberIntVal(0) for a non-computed attribute
      - .capacity_rebalance: planned value cty.False for a non-computed attribute
2024-05-27T15:24:57.661Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_alb_listener.algosolved-http-forward, but we are tolerating it because it is using the legacy plugin SDK.
    The following problems may be the cause of any confusing errors from downstream operations:
      - .default_action[0].target_group_arn: planned value cty.StringVal("") for a non-computed attribute
      - .default_action[0].redirect[0].host: planned value cty.StringVal("#{host}") for a non-computed attribute
      - .default_action[0].redirect[0].path: planned value cty.StringVal("/#{path}") for a non-computed attribute
      - .default_action[0].redirect[0].query: planned value cty.StringVal("#{query}") for a non-computed attribute
2024-05-27T15:24:57.676Z [INFO]  backend/local: plan operation completed

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_autoscaling_group.algosolved-ec2-asg will be updated in-place
  ~ resource "aws_autoscaling_group" "algosolved-ec2-asg" {
        id                               = "algosolved-ec2-asg"
        name                             = "algosolved-ec2-asg"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ vpc_zone_identifier              = (sensitive value)
        # (30 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_db_instance.algosolved-rdb will be created
  + resource "aws_db_instance" "algosolved-rdb" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "algosolved-rdb"
      + db_subnet_group_name                  = "algosolved-subnet-group"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "16"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags                                  = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + tags_all                              = {
          + "Project" = "algosolved"
          + "Stage"   = "prod"
        }
      + timezone                              = (known after apply)
      + username                              = "root"
      + vpc_security_group_ids                = [
          + "sg-04bcecd9b86d61bad",
        ]
    }

  # aws_db_subnet_group.algosovled-subnet-group will be updated in-place
  ~ resource "aws_db_subnet_group" "algosovled-subnet-group" {
        id                      = "algosolved-subnet-group"
        name                    = "algosolved-subnet-group"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ subnet_ids              = (sensitive value)
        tags                    = {
            "Project" = "algosolved"
            "Stage"   = "prod"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_ecr_repository.algosolved_repository will be updated in-place
  ~ resource "aws_ecr_repository" "algosolved_repository" {
        id                   = "algosolved-ecr"
        name                 = "algosolved-ecr"
      ~ tags                 = {
          - "Project" = "algosolved" -> null
          - "Stage"   = "prod" -> null
        }
      ~ tags_all             = {
          - "Project" = "algosolved" -> null
          - "Stage"   = "prod" -> null
        }
        # (4 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_launch_template.algosolved-lt will be updated in-place
  ~ resource "aws_launch_template" "algosolved-lt" {
        id                                   = "lt-0ab2561671d221a8a"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ key_name                             = (sensitive value)
        name                                 = "algosolved-launch-template"
        tags                                 = {
            "Project" = "algosolved"
            "Stage"   = "prod"
        }
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lb.algosolved-lb will be updated in-place
  ~ resource "aws_lb" "algosolved-lb" {
        id                                                           = "arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:loadbalancer/app/algosolved-alb/b2ca87625a4599c9"
        name                                                         = "algosolved-alb"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ subnets                                                      = (sensitive value)
        tags                                                         = {
            "Project" = "algosolved"
            "Stage"   = "prod"
        }
        # (25 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # aws_lb_target_group.algosolved-lb-tg will be updated in-place
  ~ resource "aws_lb_target_group" "algosolved-lb-tg" {
        id                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:targetgroup/algosolved-ec2-target-group/834fe560b1474f0f"
        name                               = "algosolved-ec2-target-group"
        tags                               = {
            "Project" = "algosolved"
            "Stage"   = "prod"
        }
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ vpc_id                             = (sensitive value)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_security_group.algosolved-ec2-sg will be updated in-place
  ~ resource "aws_security_group" "algosolved-ec2-sg" {
        id                     = "sg-012edd67d8f2929e0"
        name                   = "algosolved-ec2-sgp"
        tags                   = {
            "Project" = "algosolved"
            "Stage"   = "prod"
        }
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ vpc_id                 = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # aws_security_group.algosolved-rds-sg will be updated in-place
  ~ resource "aws_security_group" "algosolved-rds-sg" {
        id                     = "sg-04bcecd9b86d61bad"
        name                   = "algosolved-rds-sgp"
        tags                   = {
            "Project" = "algosolved"
            "Stage"   = "prod"
        }
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change. The value is unchanged.
      ~ vpc_id                 = (sensitive value)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 8 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
::debug::Terraform exited with code 0.
::debug::stdout: random_string.password: Refreshing state... [id=M9axbhdBAI9j4gg4]%0Aaws_db_subnet_group.algosovled-subnet-group: Refreshing state... [id=algosolved-subnet-group]%0Aaws_ecr_repository.algosolved_repository: Refreshing state... [id=algosolved-ecr]%0Aaws_lb_target_group.algosolved-lb-tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:targetgroup/algosolved-ec2-target-group/834fe560b1474f0f]%0Aaws_security_group.algosolved-rds-sg: Refreshing state... [id=sg-04bcecd9b86d61bad]%0Adata.aws_ami.ubuntu: Reading...%0Aaws_security_group.algosolved-ec2-sg: Refreshing state... [id=sg-012edd67d8f2929e0]%0Aaws_lb.algosolved-lb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:loadbalancer/app/algosolved-alb/b2ca87625a4599c9]%0Adata.aws_ami.ubuntu: Read complete after 1s [id=ami-00dade17b7cbec931]%0Aaws_launch_template.algosolved-lt: Refreshing state... [id=lt-0ab2561671d221a8a]%0Aaws_autoscaling_group.algosolved-ec2-asg: Refreshing state... [id=algosolved-ec2-asg]%0Aaws_alb_listener.algosolved-http-forward: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:listener/app/algosolved-alb/b2ca87625a4599c9/f8e55bf4f14dd805]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A%0ATerraform will perform the following actions:%0A%0A  # aws_autoscaling_group.algosolved-ec2-asg will be updated in-place%0A  ~ resource "aws_autoscaling_group" "algosolved-ec2-asg" {%0A        id                               = "algosolved-ec2-asg"%0A        name                             = "algosolved-ec2-asg"%0A      # Warning: this attribute value will be marked as sensitive and will not%0A      # display in UI output after applying this change. The value is unchanged.%0A      ~ vpc_zone_identifier              = (sensitive value)%0A        # (30 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # aws_db_instance.algosolved-rdb will be created%0A  + resource "aws_db_instance" "algosolved-rdb" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 10%0A      + apply_immediately                     = false%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = (known after apply)%0A      + backup_target                         = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_name                               = "algosolved-rdb"%0A      + db_subnet_group_name                  = "algosolved-subnet-group"%0A      + dedicated_log_volume                  = false%0A      + delete_automated_backups              = true%0A      + domain_fqdn                           = (known after apply)%0A      + endpoint                              = (known after apply)%0A      + engine                                = "postgres"%0A      + engine_version                        = "16"%0A      + engine_version_actual                 = (known after apply)%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = (known after apply)%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t2.micro"%0A      + iops                                  = (known after apply)%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + listener_endpoint                     = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + master_user_secret                    = (known after apply)%0A      + master_user_secret_kms_key_id         = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = (known after apply)%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = (known after apply)%0A      + password                              = (sensitive value)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + publicly_accessible                   = false%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = false%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_throughput                    = (known after apply)%0A      + storage_type                          = (known after apply)%0A      + tags                                  = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + tags_all                              = {%0A          + "Project" = "algosolved"%0A          + "Stage"   = "prod"%0A        }%0A      + timezone                              = (known after apply)%0A      + username                              = "root"%0A      + vpc_security_group_ids                = [%0A          + "sg-04bcecd9b86d61bad",%0A        ]%0A    }%0A%0A  # aws_db_subnet_group.algosovled-subnet-group will be updated in-place%0A  ~ resource "aws_db_subnet_group" "algosovled-subnet-group" {%0A        id                      = "algosolved-subnet-group"%0A        name                    = "algosolved-subnet-group"%0A      # Warning: this attribute value will be marked as sensitive and will not%0A      # display in UI output after applying this change. The value is unchanged.%0A      ~ subnet_ids              = (sensitive value)%0A        tags                    = {%0A            "Project" = "algosolved"%0A            "Stage"   = "prod"%0A        }%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A  # aws_ecr_repository.algosolved_repository will be updated in-place%0A  ~ resource "aws_ecr_repository" "algosolved_repository" {%0A        id                   = "algosolved-ecr"%0A        name                 = "algosolved-ecr"%0A      ~ tags                 = {%0A          - "Project" = "algosolved" -> null%0A          - "Stage"   = "prod" -> null%0A        }%0A      ~ tags_all             = {%0A          - "Project" = "algosolved" -> null%0A          - "Stage"   = "prod" -> null%0A        }%0A        # (4 unchanged attributes hidden)%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # aws_launch_template.algosolved-lt will be updated in-place%0A  ~ resource "aws_launch_template" "algosolved-lt" {%0A        id                                   = "lt-0ab2561671d221a8a"%0A      # Warning: this attribute value will be marked as sensitive and will not%0A      # display in UI output after applying this change. The value is unchanged.%0A      ~ key_name                             = (sensitive value)%0A        name                                 = "algosolved-launch-template"%0A        tags                                 = {%0A            "Project" = "algosolved"%0A            "Stage"   = "prod"%0A        }%0A        # (17 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # aws_lb.algosolved-lb will be updated in-place%0A  ~ resource "aws_lb" "algosolved-lb" {%0A        id                                                           = "arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:loadbalancer/app/algosolved-alb/b2ca87625a4599c9"%0A        name                                                         = "algosolved-alb"%0A      # Warning: this attribute value will be marked as sensitive and will not%0A      # display in UI output after applying this change. The value is unchanged.%0A      ~ subnets                                                      = (sensitive value)%0A        tags                                                         = {%0A            "Project" = "algosolved"%0A            "Stage"   = "prod"%0A        }%0A        # (25 unchanged attributes hidden)%0A%0A        # (7 unchanged blocks hidden)%0A    }%0A%0A  # aws_lb_target_group.algosolved-lb-tg will be updated in-place%0A  ~ resource "aws_lb_target_group" "algosolved-lb-tg" {%0A        id                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:471112990651:targetgroup/algosolved-ec2-target-group/834fe560b1474f0f"%0A        name                               = "algosolved-ec2-target-group"%0A        tags                               = {%0A            "Project" = "algosolved"%0A            "Stage"   = "prod"%0A        }%0A      # Warning: this attribute value will be marked as sensitive and will not%0A      # display in UI output after applying this change. The value is unchanged.%0A      ~ vpc_id                             = (sensitive value)%0A        # (17 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # aws_security_group.algosolved-ec2-sg will be updated in-place%0A  ~ resource "aws_security_group" "algosolved-ec2-sg" {%0A        id                     = "sg-012edd67d8f2929e0"%0A        name                   = "algosolved-ec2-sgp"%0A        tags                   = {%0A            "Project" = "algosolved"%0A            "Stage"   = "prod"%0A        }%0A      # Warning: this attribute value will be marked as sensitive and will not%0A      # display in UI output after applying this change. The value is unchanged.%0A      ~ vpc_id                 = (sensitive value)%0A        # (8 unchanged attributes hidden)%0A    }%0A%0A  # aws_security_group.algosolved-rds-sg will be updated in-place%0A  ~ resource "aws_security_group" "algosolved-rds-sg" {%0A        id                     = "sg-04bcecd9b86d61bad"%0A        name                   = "algosolved-rds-sgp"%0A        tags                   = {%0A            "Project" = "algosolved"%0A            "Stage"   = "prod"%0A        }%0A      # Warning: this attribute value will be marked as sensitive and will not%0A      # display in UI output after applying this change. The value is unchanged.%0A      ~ vpc_id                 = (sensitive value)%0A        # (8 unchanged attributes hidden)%0A    }%0A%0APlan: 1 to add, 8 to change, 0 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ANote: You didn't use the -out option to save this plan, so Terraform can't%0Aguarantee to take exactly these actions if you run "terraform apply" now.%0A
::debug::stderr: 2024-05-27T15:24:50.148Z [INFO]  Terraform version: 1.8.1%0A2024-05-27T15:24:50.148Z [INFO]  Go runtime version: go1.22.1%0A2024-05-27T15:24:50.148Z [INFO]  CLI args: []string{"/home/runner/work/_temp/209a151b-9a7c-45ad-a752-49f9eb131a7f/terraform-bin", "plan", "-no-color"}%0A2024-05-27T15:24:50.148Z [INFO]  CLI command args: []string{"plan", "-no-color"}%0A2024-05-27T15:24:50.152Z [INFO]  backend-s3.aws-base: Retrieved credentials: tf_backend.operation=Configure tf_backend.req_id=d3eee869-444f-9bf3-e5d7-0638b25aa13c tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate tf_aws.credentials_source=EnvConfigCredentials%0A2024-05-27T15:24:51.021Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=d3eee869-444f-9bf3-e5d7-0638b25aa13c tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-27T15:24:51.208Z [INFO]  backend-s3.aws-base: Retrieved caller identity from STS: tf_backend.operation=Configure tf_backend.req_id=d3eee869-444f-9bf3-e5d7-0638b25aa13c tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-27T15:24:51.575Z [INFO]  backend/local: starting Plan operation%0A2024-05-27T15:24:52.340Z [INFO]  backend-s3: Downloading remote state: tf_backend.operation=Get tf_backend.req_id=6df1da2b-8031-6b93-f319-05e2190d59f9 tf_backend.s3.bucket=algosolved-terraform-s3 tf_backend.s3.path=infra/prod/terraform.tfstate%0A2024-05-27T15:24:52.894Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-27T15:24:52.993Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-27T15:24:52.992Z%0A2024-05-27T15:24:53.650Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-27T15:24:53.659Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-27T15:24:53.658Z%0A2024-05-27T15:24:53.687Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-27T15:24:53.767Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-27T15:24:53.766Z%0A2024-05-27T15:24:53.792Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-27T15:24:53.806Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-27T15:24:53.806Z%0A2024-05-27T15:24:53.903Z [INFO]  backend/local: plan calling Plan%0A2024-05-27T15:24:53.907Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-27T15:24:53.991Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: configuring server automatic mTLS: timestamp=2024-05-27T15:24:53.991Z%0A2024-05-27T15:24:54.016Z [INFO]  provider: configuring client automatic mTLS%0A2024-05-27T15:24:54.028Z [INFO]  provider.terraform-provider-random_v3.6.1_x5: configuring server automatic mTLS: timestamp=2024-05-27T15:24:54.025Z%0A2024-05-27T15:24:54.117Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved credentials: tf_aws.credentials_source=EnvConfigCredentials tf_req_id=a3576bcd-8702-910b-c1c9-01e6359749c1 tf_rpc=ConfigureProvider @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 tf_mux_provider="*schema.GRPCProviderServer" tf_provider_addr=registry.terraform.io/hashicorp/aws @module=aws.aws-base timestamp=2024-05-27T15:24:54.117Z%0A2024-05-27T15:24:54.854Z [INFO]  provider.terraform-provider-aws_v5.49.0_x5: Retrieved caller identity from STS: tf_provider_addr=registry.terraform.io/hashicorp/aws tf_req_id=a3576bcd-8702-910b-c1c9-01e6359749c1 @caller=github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.53/logging/tf_logger.go:39 @module=aws.aws-base tf_mux_provider="*schema.GRPCProviderServer" tf_rpc=ConfigureProvider timestamp=2024-05-27T15:24:54.853Z%0A2024-05-27T15:24:55.692Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-ec2-sg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute%0A2024-05-27T15:24:55.719Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_security_group.algosolved-rds-sg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .revoke_rules_on_delete: planned value cty.False for a non-computed attribute%0A2024-05-27T15:24:55.871Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_ecr_repository.algosolved_repository, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .tags_all: planned value cty.MapValEmpty(cty.String) does not match config value cty.MapVal(map[string]cty.Value{"Project":cty.StringVal("algosolved"), "Stage":cty.StringVal("prod")}) nor prior value cty.MapVal(map[string]cty.Value{"Project":cty.StringVal("algosolved"), "Stage":cty.StringVal("prod")})%0A      - .image_tag_mutability: planned value cty.StringVal("MUTABLE") for a non-computed attribute%0A      - .tags: planned value cty.MapValEmpty(cty.String) for a non-computed attribute%0A      - .encryption_configuration: block count in plan (1) disagrees with count in config (0)%0A      - .image_scanning_configuration: block count in plan (1) disagrees with count in config (0)%0A2024-05-27T15:24:56.311Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb_target_group.algosolved-lb-tg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .lambda_multi_value_headers_enabled: planned value cty.False for a non-computed attribute%0A      - .proxy_protocol_v2: planned value cty.False for a non-computed attribute%0A      - .slow_start: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .target_type: planned value cty.StringVal("instance") for a non-computed attribute%0A      - .target_failover: block count in plan (1) disagrees with count in config (0)%0A      - .target_health_state: block count in plan (1) disagrees with count in config (0)%0A      - .health_check[0].protocol: planned value cty.StringVal("HTTP") for a non-computed attribute%0A      - .health_check[0].enabled: planned value cty.True for a non-computed attribute%0A      - .stickiness: block count in plan (1) disagrees with count in config (0)%0A2024-05-27T15:24:56.433Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_launch_template.algosolved-lt, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .user_data: planned value cty.StringVal("") for a non-computed attribute%0A      - .ebs_optimized: planned value cty.StringVal("") for a non-computed attribute%0A      - .ram_disk_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .security_group_names: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .disable_api_stop: planned value cty.False for a non-computed attribute%0A      - .disable_api_termination: planned value cty.False for a non-computed attribute%0A      - .instance_initiated_shutdown_behavior: planned value cty.StringVal("") for a non-computed attribute%0A      - .kernel_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].no_device: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].virtual_name: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].encrypted: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].kms_key_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].snapshot_id: planned value cty.StringVal("") for a non-computed attribute%0A      - .block_device_mappings[0].ebs[0].delete_on_termination: planned value cty.StringVal("") for a non-computed attribute%0A2024-05-27T15:24:56.576Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_subnet_group.algosovled-subnet-group, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .description: planned value cty.StringVal("Managed by Terraform") for a non-computed attribute%0A2024-05-27T15:24:56.583Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_db_instance.algosolved-rdb, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .publicly_accessible: planned value cty.False for a non-computed attribute%0A      - .monitoring_interval: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .delete_automated_backups: planned value cty.True for a non-computed attribute%0A      - .auto_minor_version_upgrade: planned value cty.True for a non-computed attribute%0A      - .apply_immediately: planned value cty.False for a non-computed attribute%0A      - .performance_insights_enabled: planned value cty.False for a non-computed attribute%0A      - .dedicated_log_volume: planned value cty.False for a non-computed attribute%0A      - .copy_tags_to_snapshot: planned value cty.False for a non-computed attribute%0A      - .skip_final_snapshot: planned value cty.False for a non-computed attribute%0A2024-05-27T15:24:56.686Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_lb.algosolved-lb, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .drop_invalid_header_fields: planned value cty.False for a non-computed attribute%0A      - .enable_xff_client_port: planned value cty.False for a non-computed attribute%0A      - .enable_tls_version_and_cipher_suite_headers: planned value cty.False for a non-computed attribute%0A      - .xff_header_processing_mode: planned value cty.StringVal("append") for a non-computed attribute%0A      - .desync_mitigation_mode: planned value cty.StringVal("defensive") for a non-computed attribute%0A      - .preserve_host_header: planned value cty.False for a non-computed attribute%0A      - .enable_http2: planned value cty.True for a non-computed attribute%0A      - .enable_waf_fail_open: planned value cty.False for a non-computed attribute%0A      - .customer_owned_ipv4_pool: planned value cty.StringVal("") for a non-computed attribute%0A      - .enable_cross_zone_load_balancing: planned value cty.True for a non-computed attribute%0A      - .client_keep_alive: planned value cty.NumberIntVal(3600) for a non-computed attribute%0A      - .enable_deletion_protection: planned value cty.False for a non-computed attribute%0A      - .access_logs: block count in plan (1) disagrees with count in config (0)%0A      - .connection_logs: block count in plan (1) disagrees with count in config (0)%0A2024-05-27T15:24:57.347Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_autoscaling_group.algosolved-ec2-asg, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .termination_policies: planned value cty.ListValEmpty(cty.String) for a non-computed attribute%0A      - .context: planned value cty.StringVal("") for a non-computed attribute%0A      - .enabled_metrics: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .launch_configuration: planned value cty.StringVal("") for a non-computed attribute%0A      - .metrics_granularity: planned value cty.StringVal("1Minute") for a non-computed attribute%0A      - .suspended_processes: planned value cty.SetValEmpty(cty.String) for a non-computed attribute%0A      - .force_delete_warm_pool: planned value cty.False for a non-computed attribute%0A      - .protect_from_scale_in: planned value cty.False for a non-computed attribute%0A      - .health_check_grace_period: planned value cty.NumberIntVal(300) for a non-computed attribute%0A      - .force_delete: planned value cty.False for a non-computed attribute%0A      - .wait_for_capacity_timeout: planned value cty.StringVal("10m") for a non-computed attribute%0A      - .placement_group: planned value cty.StringVal("") for a non-computed attribute%0A      - .default_instance_warmup: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .desired_capacity_type: planned value cty.StringVal("") for a non-computed attribute%0A      - .ignore_failed_scaling_activities: planned value cty.False for a non-computed attribute%0A      - .max_instance_lifetime: planned value cty.NumberIntVal(0) for a non-computed attribute%0A      - .capacity_rebalance: planned value cty.False for a non-computed attribute%0A2024-05-27T15:24:57.661Z [WARN]  Provider "registry.terraform.io/hashicorp/aws" produced an invalid plan for aws_alb_listener.algosolved-http-forward, but we are tolerating it because it is using the legacy plugin SDK.%0A    The following problems may be the cause of any confusing errors from downstream operations:%0A      - .default_action[0].target_group_arn: planned value cty.StringVal("") for a non-computed attribute%0A      - .default_action[0].redirect[0].host: planned value cty.StringVal("#{host}") for a non-computed attribute%0A      - .default_action[0].redirect[0].path: planned value cty.StringVal("/#{path}") for a non-computed attribute%0A      - .default_action[0].redirect[0].query: planned value cty.StringVal("#{query}") for a non-computed attribute%0A2024-05-27T15:24:57.676Z [INFO]  backend/local: plan operation completed%0A
::debug::exitcode: 0

```

</details>




**Pusher: @rha6780**